Repository: oxygenxml/blog
Catalog: translations/xliff/2nd translation/translated/oxygen_xml_blog_ro.ditamap.tmx
Source language: en
Languages: ro

source: Behavior: If the specified threshold of AI requests is exceeded, Oxygen displays a confirmation dialog box. You can choose to stop using the XPath AI functions if the volume seems excessive.
ro: Comportament: Dacă pragul specificat de cereri AI este depășit, Oxygen afișează o casetă de dialog de confirmare. Puteți alege să opriți utilizarea funcțiilor XPath AI dacă volumul vi se pare excesiv.

source: Summary: Why Use AI XPath Functions in Oxygen?
ro: Rezumat: De ce să folosiți funcțiile XPath AI în Oxygen?

source: Express style, validation, and transformation in natural language , eliminating the need for numerous rigid rules.
ro: Exprimați stilul, validarea și transformarea în limbaj natural , eliminând nevoia pentru numeroase reguli rigide.

source: Automate repetitive editorial tasks (e.g., word count, voice, grammar) and provide AI-powered fixes directly in authoring tools.
ro: Automatizați sarcinile editoriale repetitive (ex.: numărare cuvinte, voce, gramatică) și oferiți corecții AI direct în instrumentele de editare.

source: Control resource usage, compliance, and performance through detailed configuration options.
ro: Controlați utilizarea resurselor, conformitatea și performanța prin opțiuni detaliate de configurare.

source: These features are revolutionizing the XML content pipeline, enabling smart, standards-compliant authoring and validation to be effortless and secure.
ro: Aceste funcționalități revoluționează fluxul de conținut XML, permițând o editare și validare inteligentă, conformă cu standardele, într-un mod facil și sigur.

source: Ready to integrate AI into your XML workflow? Activate these options in Oxygen XML Editor and start making your content more consistent, compliant, and future-ready today.
ro: Sunteți gata să integrați AI în fluxul dumneavoastră XML? Activați aceste opțiuni în Oxygen XML Editor și începeți să vă faceți conținutul mai consecvent, conform și pregătit pentru viitor chiar de astăzi.

source: AI Positron XPath Extension Functions
ro: Funcții de extensie XPath AI Positron

source: AI XPath Extension Functions Options
ro: Opțiuni pentru funcțiile de extensie XPath AI

source: XPath AI Extension Functions Explained
ro: Explicații pentru funcțiile de extensie XPath AI

source: Creating Custom AI Actions for the AI Positron add-on
ro: Crearea acțiunilor AI personalizate pentru suplimentul AI Positron

source: In the AI Positron Assistant preferences page , you can define a reference to a folder that contains custom actions.
ro: În pagina de preferințe AI Positron Assistant , puteți defini o referință către un folder care conține acțiuni personalizate.

source: Once the add-on is installed, the New Document wizard can be used to create either a new AI Positron Custom Action file that contains a custom action definition in JSON format or an AI Positron Custom Actions List that contains a JSON array with multiple defined actions. Validation and content completion are automatically provided for such custom action files. To edit multi-line parameter values, you can switch the edited action JSON definition file to the Author visual editor mode.
ro: După instalarea suplimentului, expertul New Document poate fi folosit pentru a crea fie un fișier AI Positron Custom Action nou, care conține o definiție de acțiune personalizată în format JSON, fie o AI Positron Custom Actions List care conține un array JSON cu mai multe acțiuni definite. Pentru astfel de fișiere de acțiuni personalizate, validarea și completarea de conținut sunt oferite automat. Pentru a edita valori de parametri pe mai multe linii, puteți comuta fișierul JSON de definiție a acțiunii editate în modul vizual Author .

source: If the action definition files are saved in the custom actions folder defined in the AI Positron Assistant preferences page, the AI Positron Assistant view should automatically reload its Actions list to include them.
ro: Dacă fișierele de definiție a acțiunilor sunt salvate în folderul de acțiuni personalizate definit în pagina de preferințe AI Positron Assistant, vizualizarea AI Positron Assistant ar trebui să reîncarce automat lista de acțiuni pentru a le include.

source: Various examples of custom AI actions can be found here and can be used as starting points for your own similar AI actions.
ro: Diverse exemple de acțiuni AI personalizate pot fi găsite aici și pot fi folosite ca puncte de pornire pentru propriile acțiuni AI similare.

source: An AI action definition may contain the following properties:
ro: O definiție de acțiune AI poate conține următoarele proprietăți:

source: A unique ID for the action. If the ID of the action starts with agent.hidden.action. , then the action is not visible to be invoked directly but can be called by using the invoke_ai_action(actionID, content) function.
ro: Un ID unic pentru acțiune. Dacă ID-ul acțiunii începe cu agent.hidden.action. , atunci acțiunea nu este vizibilă pentru a fi invocată direct, dar poate fi apelată folosind funcția invoke_ai_action(actionID, content) .

source: Example:
ro: Exemplu:

source: An Oxygen desktop plugin can contribute an extra translation.xml file that contains translations. Such a plugin may translate titles and descriptions for AI actions using the action ID as part of the key.
ro: Un plugin desktop Oxygen poate contribui cu un fișier suplimentar translation.xml care conține traduceri. Un astfel de plugin poate traduce titluri și descrieri pentru acțiuni AI folosind ID-ul acțiunii ca parte a cheii.

source: The action name/title that gets presented in the UI.
ro: Numele/titlul acțiunii care este afișat în interfața utilizatorului.

source: A longer description of what the AI action does, usually used as a tooltip.
ro: O descriere mai lungă a ceea ce face acțiunea AI, folosită de obicei ca tooltip.

source: A shorter description for the AI action that usually appears under the action title in the chat view. If not specified, it defaults to the description value.
ro: O descriere mai scurtă pentru acțiunea AI, care apare de obicei sub titlul acțiunii în vizualizarea de chat. Dacă nu este specificată, se folosește valoarea din description.

source: The optional category in which the AI action is visually grouped, if not specified it defaults to Other .
ro: Categoria opțională în care acțiunea AI este grupată vizual; dacă nu este specificată, valoarea implicită este Other .

source: A framework pattern (like ' DITA* ') or content type name (like ' text/css ') that, when matched, presents the action when the document belonging to the framework is opened.
ro: Un pattern de framework (precum ' DITA* ') sau un nume de tip de conținut (precum ' text/css ') care, atunci când se potrivește, afișează acțiunea când documentul aparținând framework-ului este deschis.

source: An example of an AI action that shows this for any edited XML document (as it matches the text/xml content type) can be found here .
ro: Un exemplu de acțiune AI care afișează acest lucru pentru orice document XML editat (deoarece se potrivește cu tipul de conținut text/xml ) poate fi găsit aici .

source: A reference to a separate file (usually encoded in Markdown) which defines the entire action prompt.
ro: O referință către un fișier separat (de obicei codificat în Markdown) care definește întregul prompt al acțiunii.

source: Example :
ro: Exemplu :

source: The prompt is the most important part of the AI action. A prompt must be as precise and detailed as possible, including examples. Some companies may adopt prompt methodologies like COSTAR to specify the prompt value. The context prompt defined in the Oxygen AI Positron Preferences page is used as a prefix for all AI action prompts.
ro: Promptul este cea mai importantă parte a acțiunii AI. Un prompt trebuie să fie cât mai precis și detaliat posibil, incluzând exemple. Unele companii pot adopta metodologii de prompt precum COSTAR pentru a specifica valoarea promptului. Promptul de context definit în pagina de preferințe Oxygen AI Positron este folosit ca prefix pentru toate prompturile acțiunilor AI.

source: Here is an example of a large prompt file .
ro: Aici este un exemplu de fișier prompt mare .

source: A custom AI action can expand the context prompt in a specific part of its prompt by using the ${contextPrompt} variable in its own prompt.
ro: O acțiune AI personalizată poate extinde promptul de context într-o anumită parte a promptului său folosind variabila ${contextPrompt} în propriul prompt.

source: To define a custom AI action that does not use the context prompt in any way, in the AI action's JSON configuration file, you can expand the context prompt to an empty value like this:
ro: Pentru a defini o acțiune AI personalizată care nu folosește deloc promptul de context, în fișierul de configurare JSON al acțiunii AI, puteți extinde promptul de context la o valoare goală astfel:

source: Multi-line parameter value that defines inline the prompt that is sent to the AI along with the content to be processed.
ro: Valoare de parametru pe mai multe linii care definește inline promptul trimis către AI împreună cu conținutul ce trebuie procesat.

source: A JSON array that can define values for parameters that should be expanded in the context content.
ro: Un array JSON care poate defini valori pentru parametri ce trebuie extinși în conținutul de context.

source: You can define parameters that can be configured by the end user when hovering over the AI action in the UI.
ro: Puteți defini parametri care pot fi configurați de utilizatorul final atunci când trece cu mouse-ul peste acțiunea AI în interfață.

source: The following properties are available for a defined parameter:
ro: Următoarele proprietăți sunt disponibile pentru un parametru definit:

source: The parameter name. It can be referenced multiple times with the syntax ${param_name} in the context parameter or in the external prompt file referenced using prompt_ref .
ro: Numele parametrului. Poate fi referențiat de mai multe ori cu sintaxa ${param_name} în parametrul context sau în fișierul prompt extern referențiat prin prompt_ref .

source: The label that appears in the UI when the parameter's value is configured by the end user.
ro: Eticheta care apare în interfață atunci când valoarea parametrului este configurată de utilizatorul final.

source: The value of the parameter. It can contain various editor variables that get automatically expanded.
ro: Valoarea parametrului. Poate conține diverse variabile de editor care sunt expandate automat.

source: An optional array of alternate values that are available to be configured by the end user when hovering over the AI action.
ro: Un array opțional de valori alternative care pot fi configurate de utilizatorul final atunci când trece cu mouse-ul peste acțiunea AI.

source: An optional choice type that defines how the end user can configure the alternate values (combo box, check boxes, radio buttons).
ro: Un tip de alegere opțional care definește modul în care utilizatorul final poate configura valorile alternative (combo box, check box-uri, butoane radio).

source: The optional prefix value to be used for each expansion of the parameter's value.
ro: Valoarea opțională de prefix care va fi folosită la fiecare extindere a valorii parametrului.

source: An array of parameters that can be used to specify an engine name, temperature, or the available function definitions. Some of the most commonly set parameters:
ro: Un array de parametri care pot fi folosiți pentru a specifica un nume de motor, temperatura sau definițiile funcțiilor disponibile. Câțiva dintre cei mai des folosiți parametri:

source: The optional name of the engine to use with the AI action, no matter what the default AI engine model is configured to be.
ro: Numele opțional al motorului care va fi folosit cu acțiunea AI, indiferent de modelul AI implicit configurat.

source: Temperature is an optional parameter that governs the randomness and thus the creativity of the responses. It is always a number between 0 (more deterministic) and 1 (more random). The default value is 0 and it should, in general, remain unspecified when your AI actions are intended for technical documentation that is precise in nature.
ro: Temperatura este un parametru opțional care guvernează gradul de aleatoriu și, implicit, creativitatea răspunsurilor. Este întotdeauna un număr între 0 (mai determinist) și 1 (mai aleatoriu). Valoarea implicită este 0 și, în general, ar trebui să rămână nespecificată atunci când acțiunile AI sunt destinate documentației tehnice de natură precisă.

source: An optional JSON array that describes which functions can be used when executing this action.
ro: Un array JSON opțional care descrie ce funcții pot fi folosite la executarea acestei acțiuni.

source: Example of an AI action that uses Retrieval Augmented Generation (RAG) functions to find related content in the project:
ro: Exemplu de acțiune AI care folosește funcții Retrieval Augmented Generation (RAG) pentru a găsi conținut relevant în proiect:

source: Example of an AI action that uses the get_content_for_document_url function to retrieve content from a web site:
ro: Exemplu de acțiune AI care folosește funcția get_content_for_document_url pentru a prelua conținut de pe un site web:

source: There are specific actions that can be called to invoke other AI actions from an AI action, thus creating an agenting mechanism where various parts of the work is done by various actions. An example can be found here .
ro: Există acțiuni specifice care pot fi apelate pentru a invoca alte acțiuni AI dintr-o acțiune AI, creând astfel un mecanism de agentizare unde diverse părți ale lucrului sunt realizate de diverse acțiuni. Un exemplu poate fi găsit aici .

source: Defines which part of the current document should be sent to be processed by the AI engine.
ro: Definește ce parte din documentul curent trebuie trimisă pentru a fi procesată de motorul AI.

source: selection, document [default]
ro: selection, document [implicit]

source: Prefers sending the selected content. If there is no selection, it selects and sends the entire document.
ro: Preferă trimiterea conținutului selectat. Dacă nu există selecție, selectează și trimite întregul document.

source: Prefers sending the selected content. If no content is selected, either no content is sent or an error message is received (depending on the action's output-action ).
ro: Preferă trimiterea conținutului selectat. Dacă nu este selectat niciun conținut, fie nu se trimite nimic, fie se primește un mesaj de eroare (în funcție de output-action al acțiunii).

source: Always sends the entire document for processing, regardless if there is content selected inside it.
ro: Trimite întotdeauna întregul document pentru procesare, indiferent dacă există conținut selectat în interiorul acestuia.

source: Does not send any content from the current document. See this example .
ro: Nu trimite niciun conținut din documentul curent. Vezi acest exemplu .

source: Describes how the XML content from the document that is sent to the platform should be processed, as regular XML including markup tags or as plain text without the tags and with all DITA XML content references and key references expanded. By default, its value is assumed to be markup , which means the content is sent exactly as it is.
ro: Descrie modul în care conținutul XML din documentul trimis către platformă trebuie procesat: ca XML obișnuit, incluzând tag-urile de markup, sau ca text simplu, fără tag-uri și cu toate conref-urile și keyref-urile DITA XML expandate. Implicit, valoarea este markup , ceea ce înseamnă că se trimite conținutul exact așa cum este.

source: Example of an AI action that requires the input to be sent without any markup tags and with the DITA XML conrefs and keyrefs expanded:
ro: Exemplu de acțiune AI care necesită ca inputul să fie trimis fără niciun tag de markup și cu conref-urile și keyref-urile DITA XML expandate:

source: Defines the type of change the AI action performs on the opened document. Some of the most commonly used type values are listed below:
ro: Definește tipul de modificare pe care acțiunea AI o efectuează asupra documentului deschis. Câteva dintre cele mai folosite valori de tip sunt enumerate mai jos:

source: The most common type of action. Sends the selected content to the AI platform and proposes to replace the selection with the received response. If there is no selected content automatically, the entire document is selected when the action is invoked.
ro: Cel mai comun tip de acțiune. Trimite conținutul selectat către platforma AI și propune înlocuirea selecției cu răspunsul primit. Dacă nu există conținut selectat, automat este selectat întregul document când acțiunea este invocată.

source: Inserts the content received from the AI engine in the current document at the cursor position or at an offset specified by the insert-modes . If the inserted content is invalid at the proposed offset, the application attempts to find a proper location for it.
ro: Inserează conținutul primit de la motorul AI în documentul curent la poziția cursorului sau la un offset specificat de insert-modes . Dacă conținutul inserat este invalid la offsetul propus, aplicația încearcă să găsească o locație potrivită pentru acesta.

source: Sends the selected content or the entire document to the AI platform and shows the response to the end user.
ro: Trimite conținutul selectat sau întregul document către platforma AI și afișează răspunsul utilizatorului final.

source: Shows a dialog box that asks for a context and then creates a new document based on the received server response. The "additional_info"/"properties"/"file_extension" property can be set to impose an extension for the newly created document.
ro: Afișează o casetă de dialog care solicită un context și apoi creează un document nou pe baza răspunsului primit de la server. Proprietatea "additional_info"/"properties"/"file_extension" poate fi setată pentru a impune o extensie pentru documentul nou creat.

source: A JSON array that defines places for inserting the content in an XML document. The first mode for which the XPath condition becomes true is run . Such modes are used when the AI action output-action is insert .
ro: Un array JSON care definește locuri pentru inserarea conținutului într-un document XML. Primul mod pentru care condiția XPath devine adevărată este run . Astfel de moduri sunt folosite când output-action al acțiunii AI este insert .

source: Set this optional boolean parameter to true to add the AI action to the top right AI Positron Assistant drop-down menu that appears when editing content in the Author visual editing mode.
ro: Setați acest parametru boolean opțional la true pentru a adăuga acțiunea AI în meniul drop-down din colțul dreapta sus AI Positron Assistant care apare la editarea conținutului în modul vizual Author .

source: Set this optional boolean parameter to true to add the AI action to the quick assist bulb drop-down menu that appears in the left vertical stripe.
ro: Setați acest parametru boolean opțional la true pentru a adăuga acțiunea AI în meniul drop-down de tip bec de asistență rapidă care apare pe bara verticală din stânga.

source: Hope this helped, as always you can use the feedback form below if you want to ask more details about the possibilities of AI actions or want to brag about the custom AI actions you have created.
ro: Sper că aceste informații v-au fost de ajutor. Ca de obicei, puteți folosi formularul de feedback de mai jos dacă doriți să întrebați mai multe detalii despre posibilitățile acțiunilor AI sau dacă vreți să vă lăudați cu acțiunile AI personalizate pe care le-ați creat.

source: Creating Link Graphs From DITA Maps
ro: Crearea grafurilor de legături din DITA Maps

source: It may be sometimes useful as an overview to obtain a graphical visualization of how your DITA topics refer to each other. The VisJS Javascript library can be used to construct node network diagrams. Here's how you can use it for your DITA project:
ro: Poate fi uneori util, ca prezentare generală, să obțineți o vizualizare grafică a modului în care topicurile DITA se referă unele la altele. Biblioteca Javascript VisJS poate fi folosită pentru a construi diagrame de rețea de noduri. Iată cum o puteți utiliza pentru proiectul dumneavoastră DITA:

source: Open the main DITA Map in the Oxygen XML Editor DITA Maps Manager view, use the Configure Transformation Scenarios button, then create a new transformation scenario of type DITA OT Transformation choosing the Merge DITA Content to Single XML file transformation type. If you are not using Oxygen XML Editor you can download and install the dita-merge plugin separately from Github .
ro: Deschideți DITA Map-ul principal în Oxygen XML Editor în vizualizarea DITA Maps Manager , folosiți butonul Configure Transformation Scenarios , apoi creați un nou scenariu de transformare de tip DITA OT Transformation alegând tipul de transformare Merge DITA Content to Single XML file . Dacă nu folosiți Oxygen XML Editor , puteți descărca și instala separat pluginul dita-merge de pe Github .

source: Apply the new transformation scenario on the DITA Map, once the merged XML document is generated, create another transformation scenario of type XML transformation with XSLT and transform to HTML using the XSLT stylesheet:
ro: Aplicați noul scenariu de transformare pe DITA Map, iar după ce documentul XML fuzionat este generat, creați un alt scenariu de transformare de tip XML transformation with XSLT și transformați în HTML folosind foaia de stil XSLT:

source: Open the result HTML document in a web browser. Depending on the complexity of the DITA project it may take some time for the diagram to show up. As an example the related links section below contains a reference to a diagram representation of the Oxygen XML Blog. If we regard the diagram as a circle, on the outer bounds of the circle are topics which have few incoming and outgoing links and in the center topics which have many outgoing and incoming links. Links from the DITA Map to the topics are not taken into account. You can interact with the diagram by dragging nodes and by using the mouse wheel to zoom in or out.
ro: Deschideți documentul HTML rezultat într-un browser web. În funcție de complexitatea proiectului DITA, poate dura ceva timp până când diagrama va fi afișată. De exemplu, secțiunea de linkuri conexe de mai jos conține o referință la o reprezentare diagramatică a Oxygen XML Blog. Dacă privim diagrama ca pe un cerc, la marginea exterioară a cercului se află topicuri cu puține legături de intrare și ieșire, iar în centru topicuri cu multe legături de intrare și ieșire. Legăturile din DITA Map către topicuri nu sunt luate în considerare. Puteți interacționa cu diagrama prin tragerea nodurilor și folosind rotița mouse-ului pentru a mări sau micșora.

source: Customizing AI Positron for Your DITA XML Project
ro: Personalizarea AI Positron pentru proiectul dumneavoastră DITA XML
